데이터 베이스(DB, DataBase)

- 데이터를 수집하여 모아 놓은 것

- 어떤 특정한 조직에서 여러 명의 사용자 또는 응용 시스템들이 공유하고 동시에 접근하여

 사용할 수 있도록 구조적으로 통합하여 저장한 운영 데이터의 집합

​

정보(Information)

- 의미있고 쓸모있는 내용으로 가공하여 체계적으로 조직한 데이터

​

데이터 베이스 정의

- 공유데이터(shared data) : 조직 내 다수의 사용자나 응용 시스템들이 데이터의 

  통합 관리를 통하여 공동으로 소유하고 유지하는 것

- 통합데이터(integrated data): 분산되어 있는 데이터를 통합하여 데이터 중복을 

  최소화하는 것

- 저장된 데이터(stored data): 컴퓨터가 접근 가능한 매체에 저장된 데이터

- 운영데이터(operational data): 특정업무를 수행하기 위해 지속적으로 유지해야 

  하는 데이터

​

데이터베이스 특징

- 실시간 처리

- 계속 변환

- 내용 기반 참조

- 동시공유

​

데이터베이스 관리시스템(DBMS)​

-파일시스템의 단점을 보안한 것이 데이터베이스 관리시스템(DBMS)이다.

- 파일시스템: 데이터 종속성과 데이터 중복성 문제가 있음

​

데이터 종속성

- 데이터와 응용 프로그램 간의 상호 의존 관계

- 접근 방법 변경시 응용 프로그램도 함께 변경하여야 함

​

데이터 중복성​

- 한 시스템 내에 데이터가 중복되는 것

​

데이터베이스 관리시스템 정의​

- 사용자나 응용 프로그램, 데이터베이스 사이에서 데이터베이스를 공유할 수 있도록 관리해 주는 

소프트웨어(software)

​

데이터베이스 관리시스템 장단점

- 중복 최소화

- 데이터 공유

- 데이터 일관성 유지

-무결성 유지

- 보안 보장

​

데이터베이스 관리시스템 종류

- 네트워크 DBMS: 레코드 구조 변경 어려움, 응용 프로그램 수정 어려움

- 계층 DBMS: 레코들 구조 변경 어려움, 응용 프로그램 수정 어려움

- 관계 DBMS: 테이블(table)기반, 사용 용이

​

데이터베이스 시스템 구성요소

- 사용자(user)

- 데이터 언어(DDL): 데이터 정의어, 데이터 조작어, 데이터 제어어가 있음

- 데이터베이스 관리시스템(DBMS)

  ex) 오라클 oracle, 마이크로소프트 SQL Server

- 데이터 베이스(DB)

​

데이터 베이스 시스템 구조 & 데이터베이스 독립성​

- 외부단계(external level): 개별사용자의 입장에서 보는 개인의 견해

- 개념단계(concept level): 조직의 입장에서 보는 조직 전체의 견해

- 내부단계(internal level): 물리적 저장장치의 입장에서 보는 저장장치의 견해

​

스키마(schema): 데이터베이스의 구조와 제약조건에 대한 명세를 기술한 것

- 외부 스키마(서브 스키마): 개별사용자입장에서 데이터베이스 구조를 기술한 것, 

  여러 형태의 외부스키마 존재

- 개념 스키마(스키마): 조직 전체 입장에서 통합한 데이터베이스를 기술한 것.

   하나의 개념스키마만 존재

- 내부 스키마: 저장장치 입장에서 전체 데이터베이스가 저장되는 방법을 명세한 것

   하나의 내부 스키마만 존재

​

사상(mapping): DBMS와 관리단계의 스키마 사이의 대응 관계

- 외부 / 개념 사상(응용 인터페이스): 외부 스키마와 개념 스키마 간의 대응관계를 

  정의한 것, 논리적 구조(개념스키마) 변경시 응용 프로그램에 영향을 주지 않아 논리적 

  데이터 독립성 제공함

- 개념 / 내부 사상(저장 인터페이스): 개념 스키마와 내부 스키마 간의 대응 관계를 정의한 것,

  물리적 구조(내부 스키마)를 변경하더라도 응용 프로그램과 논리적 구조(개념 스키마)에  

  영향을 주지 않아 물리적 데이터 독립성 제공

- 내부 / 장치 사상(장치 인터페이스): 내부 스키마와 물리적인 장치 간의 대응 관계를 

  정의한 것

​

데이터 독립성(Data Independency)

- 데이터베이스구조 변형시 응용프로그램이나 논리적 구조에 영향을 미치지 않는 것

- 논리적 데이터 독립성(logical data independency): 응용 프로그램에 영향을 주지 않고, 논리적 구조를 변경할 수 있는 것

- 물리적 데이터 독립성(physical data independency): 응용 프로그램이나 논리적 구조에 영향을 주지 않고 물리적 구조를 변경할 수 있는 것


